package task17;

/**
 * написать программу для людей, поднимающихся в горы.
 * Должен быть класс Man, у человека есть характеристики
 * - усталость (изначально 0) и выносливость - целое число.
 * Должен быть класс - Mountain,
 * у горы есть характеристики - высота, сложность (числа).
 * У человека должен быть метод climb(Mountain mountain).
 * Если человек устал на высоте выше 7 км, то ему нужно вызвать вертолет,
 * для этого человек должен отправить Exception в файл для логов.
 * Сделать несколько гор (по сложности и высоте)
 * и несколько людей (с разной выносливостью) и проверить, кто куда сможет подняться
 */
public class Main {
    Mountain everest = new Mountain();
    //everest set height complexity

}
